import { nanoid } from 'nanoid';

export const aboutProjectInfo = [
  {
    id: nanoid(),
    titleItem: 'Безопасность и конфиденциальность',
    description:
      'Сайт обеспечивает защиту ваших конфиденциальных данных и сообщений, обеспечивая безопасность передачи и хранения информации.',
  },
  {
    id: nanoid(),
    titleItem: 'Изучение и творчество',
    description:
      'Использование сайта позволяет изучать различные языки шифрования, расширять знания в области криптографии и использовать шифрование для создания загадок и головоломок.',
  },
  {
    id: nanoid(),
    titleItem: 'Удобство и доступность',
    description:
      'Удобство и доступность: Сайт предоставляет удобный и доступный способ шифрования текста, не требующий установки дополнительного программного обеспечения.',
  },
];
